7767517
124 151
Input            data             0 1 data 0=300 1=300 2=3
Split            splitncnn_0      1 7 data data_splitncnn_0 data_splitncnn_1 data_splitncnn_2 data_splitncnn_3 data_splitncnn_4 data_splitncnn_5 data_splitncnn_6
BatchNorm        data_bn          1 1 data_splitncnn_6 data_bn 0=3
Scale            data_scale       1 1 data_bn data_bn_data_scale 0=3 1=1
Convolution      conv1_h          1 1 data_bn_data_scale conv1_h 0=32 1=7 2=1 3=2 4=3 5=1 6=4704
BatchNorm        conv1_bn_h       1 1 conv1_h conv1_h_conv1_bn_h 0=32
Scale            conv1_scale_h    1 1 conv1_h_conv1_bn_h conv1_h_conv1_scale_h 0=32 1=1
ReLU             conv1_relu       1 1 conv1_h_conv1_scale_h conv1_h_conv1_relu
Pooling          conv1_pool       1 1 conv1_h_conv1_relu conv1_pool 0=0 1=3 2=2 3=0 4=0
Split            splitncnn_1      1 2 conv1_pool conv1_pool_splitncnn_0 conv1_pool_splitncnn_1
Convolution      layer_64_1_conv1_h 1 1 conv1_pool_splitncnn_1 layer_64_1_conv1_h 0=32 1=3 2=1 3=1 4=1 5=0 6=9216
BatchNorm        layer_64_1_bn2_h 1 1 layer_64_1_conv1_h layer_64_1_conv1_h_layer_64_1_bn2_h 0=32
Scale            layer_64_1_scale2_h 1 1 layer_64_1_conv1_h_layer_64_1_bn2_h layer_64_1_conv1_h_layer_64_1_scale2_h 0=32 1=1
ReLU             layer_64_1_relu2 1 1 layer_64_1_conv1_h_layer_64_1_scale2_h layer_64_1_conv1_h_layer_64_1_relu2
Convolution      layer_64_1_conv2_h 1 1 layer_64_1_conv1_h_layer_64_1_relu2 layer_64_1_conv2_h 0=32 1=3 2=1 3=1 4=1 5=0 6=9216
Eltwise          layer_64_1_sum   2 1 layer_64_1_conv2_h conv1_pool_splitncnn_0 layer_64_1_sum 0=1 -23301=0
BatchNorm        layer_128_1_bn1_h 1 1 layer_64_1_sum layer_128_1_bn1_h 0=32
Scale            layer_128_1_scale1_h 1 1 layer_128_1_bn1_h layer_128_1_bn1_h_layer_128_1_scale1_h 0=32 1=1
ReLU             layer_128_1_relu1 1 1 layer_128_1_bn1_h_layer_128_1_scale1_h layer_128_1_bn1_h_layer_128_1_relu1
Split            splitncnn_2      1 2 layer_128_1_bn1_h_layer_128_1_relu1 layer_128_1_bn1_h_layer_128_1_relu1_splitncnn_0 layer_128_1_bn1_h_layer_128_1_relu1_splitncnn_1
Convolution      layer_128_1_conv1_h 1 1 layer_128_1_bn1_h_layer_128_1_relu1_splitncnn_1 layer_128_1_conv1_h 0=128 1=3 2=1 3=2 4=1 5=0 6=36864
BatchNorm        layer_128_1_bn2  1 1 layer_128_1_conv1_h layer_128_1_conv1_h_layer_128_1_bn2 0=128
Scale            layer_128_1_scale2 1 1 layer_128_1_conv1_h_layer_128_1_bn2 layer_128_1_conv1_h_layer_128_1_scale2 0=128 1=1
ReLU             layer_128_1_relu2 1 1 layer_128_1_conv1_h_layer_128_1_scale2 layer_128_1_conv1_h_layer_128_1_relu2
Convolution      layer_128_1_conv2 1 1 layer_128_1_conv1_h_layer_128_1_relu2 layer_128_1_conv2 0=128 1=3 2=1 3=1 4=1 5=0 6=147456
Convolution      layer_128_1_conv_expand_h 1 1 layer_128_1_bn1_h_layer_128_1_relu1_splitncnn_0 layer_128_1_conv_expand_h 0=128 1=1 2=1 3=2 4=0 5=0 6=4096
Eltwise          layer_128_1_sum  2 1 layer_128_1_conv2 layer_128_1_conv_expand_h layer_128_1_sum 0=1 -23301=0
BatchNorm        layer_256_1_bn1  1 1 layer_128_1_sum layer_256_1_bn1 0=128
Scale            layer_256_1_scale1 1 1 layer_256_1_bn1 layer_256_1_bn1_layer_256_1_scale1 0=128 1=1
ReLU             layer_256_1_relu1 1 1 layer_256_1_bn1_layer_256_1_scale1 layer_256_1_bn1_layer_256_1_relu1
Split            splitncnn_3      1 3 layer_256_1_bn1_layer_256_1_relu1 layer_256_1_bn1_layer_256_1_relu1_splitncnn_0 layer_256_1_bn1_layer_256_1_relu1_splitncnn_1 layer_256_1_bn1_layer_256_1_relu1_splitncnn_2
Convolution      layer_256_1_conv1 1 1 layer_256_1_bn1_layer_256_1_relu1_splitncnn_2 layer_256_1_conv1 0=256 1=3 2=1 3=2 4=1 5=0 6=294912
BatchNorm        layer_256_1_bn2  1 1 layer_256_1_conv1 layer_256_1_conv1_layer_256_1_bn2 0=256
Scale            layer_256_1_scale2 1 1 layer_256_1_conv1_layer_256_1_bn2 layer_256_1_conv1_layer_256_1_scale2 0=256 1=1
ReLU             layer_256_1_relu2 1 1 layer_256_1_conv1_layer_256_1_scale2 layer_256_1_conv1_layer_256_1_relu2
Convolution      layer_256_1_conv2 1 1 layer_256_1_conv1_layer_256_1_relu2 layer_256_1_conv2 0=256 1=3 2=1 3=1 4=1 5=0 6=589824
Convolution      layer_256_1_conv_expand 1 1 layer_256_1_bn1_layer_256_1_relu1_splitncnn_1 layer_256_1_conv_expand 0=256 1=1 2=1 3=2 4=0 5=0 6=32768
Eltwise          layer_256_1_sum  2 1 layer_256_1_conv2 layer_256_1_conv_expand layer_256_1_sum 0=1 -23301=0
BatchNorm        layer_512_1_bn1  1 1 layer_256_1_sum layer_512_1_bn1 0=256
Scale            layer_512_1_scale1 1 1 layer_512_1_bn1 layer_512_1_bn1_layer_512_1_scale1 0=256 1=1
ReLU             layer_512_1_relu1 1 1 layer_512_1_bn1_layer_512_1_scale1 layer_512_1_bn1_layer_512_1_relu1
Split            splitncnn_4      1 2 layer_512_1_bn1_layer_512_1_relu1 layer_512_1_bn1_layer_512_1_relu1_splitncnn_0 layer_512_1_bn1_layer_512_1_relu1_splitncnn_1
Convolution      layer_512_1_conv1_h 1 1 layer_512_1_bn1_layer_512_1_relu1_splitncnn_1 layer_512_1_conv1_h 0=128 1=3 2=1 3=1 4=1 5=0 6=294912
BatchNorm        layer_512_1_bn2_h 1 1 layer_512_1_conv1_h layer_512_1_conv1_h_layer_512_1_bn2_h 0=128
Scale            layer_512_1_scale2_h 1 1 layer_512_1_conv1_h_layer_512_1_bn2_h layer_512_1_conv1_h_layer_512_1_scale2_h 0=128 1=1
ReLU             layer_512_1_relu2 1 1 layer_512_1_conv1_h_layer_512_1_scale2_h layer_512_1_conv1_h_layer_512_1_relu2
Convolution      layer_512_1_conv2_h 1 1 layer_512_1_conv1_h_layer_512_1_relu2 layer_512_1_conv2_h 0=256 1=3 2=2 3=1 4=2 5=0 6=294912
Convolution      layer_512_1_conv_expand_h 1 1 layer_512_1_bn1_layer_512_1_relu1_splitncnn_0 layer_512_1_conv_expand_h 0=256 1=1 2=1 3=1 4=0 5=0 6=65536
Eltwise          layer_512_1_sum  2 1 layer_512_1_conv2_h layer_512_1_conv_expand_h layer_512_1_sum 0=1 -23301=0
BatchNorm        last_bn_h        1 1 layer_512_1_sum layer_512_1_sum_last_bn_h 0=256
Scale            last_scale_h     1 1 layer_512_1_sum_last_bn_h layer_512_1_sum_last_scale_h 0=256 1=1
ReLU             last_relu        1 1 layer_512_1_sum_last_scale_h fc7
Split            splitncnn_5      1 4 fc7 fc7_splitncnn_0 fc7_splitncnn_1 fc7_splitncnn_2 fc7_splitncnn_3
Convolution      conv6_1_h        1 1 fc7_splitncnn_3 conv6_1_h 0=128 1=1 2=1 3=1 4=0 5=1 6=32768
ReLU             conv6_1_relu     1 1 conv6_1_h conv6_1_h_conv6_1_relu
Convolution      conv6_2_h        1 1 conv6_1_h_conv6_1_relu conv6_2_h 0=256 1=3 2=1 3=2 4=1 5=1 6=294912
ReLU             conv6_2_relu     1 1 conv6_2_h conv6_2_h_conv6_2_relu
Split            splitncnn_6      1 4 conv6_2_h_conv6_2_relu conv6_2_h_conv6_2_relu_splitncnn_0 conv6_2_h_conv6_2_relu_splitncnn_1 conv6_2_h_conv6_2_relu_splitncnn_2 conv6_2_h_conv6_2_relu_splitncnn_3
Convolution      conv7_1_h        1 1 conv6_2_h_conv6_2_relu_splitncnn_3 conv7_1_h 0=64 1=1 2=1 3=1 4=0 5=1 6=16384
ReLU             conv7_1_relu     1 1 conv7_1_h conv7_1_h_conv7_1_relu
Convolution      conv7_2_h        1 1 conv7_1_h_conv7_1_relu conv7_2_h 0=128 1=3 2=1 3=2 4=1 5=1 6=73728
ReLU             conv7_2_relu     1 1 conv7_2_h conv7_2_h_conv7_2_relu
Split            splitncnn_7      1 4 conv7_2_h_conv7_2_relu conv7_2_h_conv7_2_relu_splitncnn_0 conv7_2_h_conv7_2_relu_splitncnn_1 conv7_2_h_conv7_2_relu_splitncnn_2 conv7_2_h_conv7_2_relu_splitncnn_3
Convolution      conv8_1_h        1 1 conv7_2_h_conv7_2_relu_splitncnn_3 conv8_1_h 0=64 1=1 2=1 3=1 4=0 5=1 6=8192
ReLU             conv8_1_relu     1 1 conv8_1_h conv8_1_h_conv8_1_relu
Convolution      conv8_2_h        1 1 conv8_1_h_conv8_1_relu conv8_2_h 0=128 1=3 2=1 3=1 4=0 5=1 6=73728
ReLU             conv8_2_relu     1 1 conv8_2_h conv8_2_h_conv8_2_relu
Split            splitncnn_8      1 4 conv8_2_h_conv8_2_relu conv8_2_h_conv8_2_relu_splitncnn_0 conv8_2_h_conv8_2_relu_splitncnn_1 conv8_2_h_conv8_2_relu_splitncnn_2 conv8_2_h_conv8_2_relu_splitncnn_3
Convolution      conv9_1_h        1 1 conv8_2_h_conv8_2_relu_splitncnn_3 conv9_1_h 0=64 1=1 2=1 3=1 4=0 5=1 6=8192
ReLU             conv9_1_relu     1 1 conv9_1_h conv9_1_h_conv9_1_relu
Convolution      conv9_2_h        1 1 conv9_1_h_conv9_1_relu conv9_2_h 0=128 1=3 2=1 3=1 4=0 5=1 6=73728
ReLU             conv9_2_relu     1 1 conv9_2_h conv9_2_h_conv9_2_relu
Split            splitncnn_9      1 3 conv9_2_h_conv9_2_relu conv9_2_h_conv9_2_relu_splitncnn_0 conv9_2_h_conv9_2_relu_splitncnn_1 conv9_2_h_conv9_2_relu_splitncnn_2
Normalize        conv4_3_norm     1 1 layer_256_1_bn1_layer_256_1_relu1_splitncnn_0 conv4_3_norm 0=0 1=0 2=1.000000e-10 3=128
Split            splitncnn_10     1 3 conv4_3_norm conv4_3_norm_splitncnn_0 conv4_3_norm_splitncnn_1 conv4_3_norm_splitncnn_2
Convolution      conv4_3_norm_mbox_loc 1 1 conv4_3_norm_splitncnn_2 conv4_3_norm_mbox_loc 0=16 1=3 2=1 3=1 4=1 5=1 6=18432
Permute          conv4_3_norm_mbox_loc_perm 1 1 conv4_3_norm_mbox_loc conv4_3_norm_mbox_loc_perm 0=3
Flatten          conv4_3_norm_mbox_loc_flat 1 1 conv4_3_norm_mbox_loc_perm conv4_3_norm_mbox_loc_flat
Convolution      conv4_3_norm_mbox_conf 1 1 conv4_3_norm_splitncnn_1 conv4_3_norm_mbox_conf 0=8 1=3 2=1 3=1 4=1 5=1 6=9216
Permute          conv4_3_norm_mbox_conf_perm 1 1 conv4_3_norm_mbox_conf conv4_3_norm_mbox_conf_perm 0=3
Flatten          conv4_3_norm_mbox_conf_flat 1 1 conv4_3_norm_mbox_conf_perm conv4_3_norm_mbox_conf_flat
PriorBox         conv4_3_norm_mbox_priorbox 2 1 conv4_3_norm_splitncnn_0 data_splitncnn_5 conv4_3_norm_mbox_priorbox -23300=1,3.000000e+01 -23301=1,6.000000e+01 -23302=1,2.000000e+00 3=1.000000e-01 4=1.000000e-01 5=2.000000e-01 6=2.000000e-01 7=1 8=0 9=-233 10=-233 11=8.000000e+00 12=8.000000e+00 13=5.000000e-01
Convolution      fc7_mbox_loc     1 1 fc7_splitncnn_2 fc7_mbox_loc 0=24 1=3 2=1 3=1 4=1 5=1 6=55296
Permute          fc7_mbox_loc_perm 1 1 fc7_mbox_loc fc7_mbox_loc_perm 0=3
Flatten          fc7_mbox_loc_flat 1 1 fc7_mbox_loc_perm fc7_mbox_loc_flat
Convolution      fc7_mbox_conf    1 1 fc7_splitncnn_1 fc7_mbox_conf 0=12 1=3 2=1 3=1 4=1 5=1 6=27648
Permute          fc7_mbox_conf_perm 1 1 fc7_mbox_conf fc7_mbox_conf_perm 0=3
Flatten          fc7_mbox_conf_flat 1 1 fc7_mbox_conf_perm fc7_mbox_conf_flat
PriorBox         fc7_mbox_priorbox 2 1 fc7_splitncnn_0 data_splitncnn_4 fc7_mbox_priorbox -23300=1,6.000000e+01 -23301=1,1.110000e+02 -23302=2,2.000000e+00,3.000000e+00 3=1.000000e-01 4=1.000000e-01 5=2.000000e-01 6=2.000000e-01 7=1 8=0 9=-233 10=-233 11=1.600000e+01 12=1.600000e+01 13=5.000000e-01
Convolution      conv6_2_mbox_loc 1 1 conv6_2_h_conv6_2_relu_splitncnn_2 conv6_2_mbox_loc 0=24 1=3 2=1 3=1 4=1 5=1 6=55296
Permute          conv6_2_mbox_loc_perm 1 1 conv6_2_mbox_loc conv6_2_mbox_loc_perm 0=3
Flatten          conv6_2_mbox_loc_flat 1 1 conv6_2_mbox_loc_perm conv6_2_mbox_loc_flat
Convolution      conv6_2_mbox_conf 1 1 conv6_2_h_conv6_2_relu_splitncnn_1 conv6_2_mbox_conf 0=12 1=3 2=1 3=1 4=1 5=1 6=27648
Permute          conv6_2_mbox_conf_perm 1 1 conv6_2_mbox_conf conv6_2_mbox_conf_perm 0=3
Flatten          conv6_2_mbox_conf_flat 1 1 conv6_2_mbox_conf_perm conv6_2_mbox_conf_flat
PriorBox         conv6_2_mbox_priorbox 2 1 conv6_2_h_conv6_2_relu_splitncnn_0 data_splitncnn_3 conv6_2_mbox_priorbox -23300=1,1.110000e+02 -23301=1,1.620000e+02 -23302=2,2.000000e+00,3.000000e+00 3=1.000000e-01 4=1.000000e-01 5=2.000000e-01 6=2.000000e-01 7=1 8=0 9=-233 10=-233 11=3.200000e+01 12=3.200000e+01 13=5.000000e-01
Convolution      conv7_2_mbox_loc 1 1 conv7_2_h_conv7_2_relu_splitncnn_2 conv7_2_mbox_loc 0=24 1=3 2=1 3=1 4=1 5=1 6=27648
Permute          conv7_2_mbox_loc_perm 1 1 conv7_2_mbox_loc conv7_2_mbox_loc_perm 0=3
Flatten          conv7_2_mbox_loc_flat 1 1 conv7_2_mbox_loc_perm conv7_2_mbox_loc_flat
Convolution      conv7_2_mbox_conf 1 1 conv7_2_h_conv7_2_relu_splitncnn_1 conv7_2_mbox_conf 0=12 1=3 2=1 3=1 4=1 5=1 6=13824
Permute          conv7_2_mbox_conf_perm 1 1 conv7_2_mbox_conf conv7_2_mbox_conf_perm 0=3
Flatten          conv7_2_mbox_conf_flat 1 1 conv7_2_mbox_conf_perm conv7_2_mbox_conf_flat
PriorBox         conv7_2_mbox_priorbox 2 1 conv7_2_h_conv7_2_relu_splitncnn_0 data_splitncnn_2 conv7_2_mbox_priorbox -23300=1,1.620000e+02 -23301=1,2.130000e+02 -23302=2,2.000000e+00,3.000000e+00 3=1.000000e-01 4=1.000000e-01 5=2.000000e-01 6=2.000000e-01 7=1 8=0 9=-233 10=-233 11=6.400000e+01 12=6.400000e+01 13=5.000000e-01
Convolution      conv8_2_mbox_loc 1 1 conv8_2_h_conv8_2_relu_splitncnn_2 conv8_2_mbox_loc 0=16 1=3 2=1 3=1 4=1 5=1 6=18432
Permute          conv8_2_mbox_loc_perm 1 1 conv8_2_mbox_loc conv8_2_mbox_loc_perm 0=3
Flatten          conv8_2_mbox_loc_flat 1 1 conv8_2_mbox_loc_perm conv8_2_mbox_loc_flat
Convolution      conv8_2_mbox_conf 1 1 conv8_2_h_conv8_2_relu_splitncnn_1 conv8_2_mbox_conf 0=8 1=3 2=1 3=1 4=1 5=1 6=9216
Permute          conv8_2_mbox_conf_perm 1 1 conv8_2_mbox_conf conv8_2_mbox_conf_perm 0=3
Flatten          conv8_2_mbox_conf_flat 1 1 conv8_2_mbox_conf_perm conv8_2_mbox_conf_flat
PriorBox         conv8_2_mbox_priorbox 2 1 conv8_2_h_conv8_2_relu_splitncnn_0 data_splitncnn_1 conv8_2_mbox_priorbox -23300=1,2.130000e+02 -23301=1,2.640000e+02 -23302=1,2.000000e+00 3=1.000000e-01 4=1.000000e-01 5=2.000000e-01 6=2.000000e-01 7=1 8=0 9=-233 10=-233 11=1.000000e+02 12=1.000000e+02 13=5.000000e-01
Convolution      conv9_2_mbox_loc 1 1 conv9_2_h_conv9_2_relu_splitncnn_2 conv9_2_mbox_loc 0=16 1=3 2=1 3=1 4=1 5=1 6=18432
Permute          conv9_2_mbox_loc_perm 1 1 conv9_2_mbox_loc conv9_2_mbox_loc_perm 0=3
Flatten          conv9_2_mbox_loc_flat 1 1 conv9_2_mbox_loc_perm conv9_2_mbox_loc_flat
Convolution      conv9_2_mbox_conf 1 1 conv9_2_h_conv9_2_relu_splitncnn_1 conv9_2_mbox_conf 0=8 1=3 2=1 3=1 4=1 5=1 6=9216
Permute          conv9_2_mbox_conf_perm 1 1 conv9_2_mbox_conf conv9_2_mbox_conf_perm 0=3
Flatten          conv9_2_mbox_conf_flat 1 1 conv9_2_mbox_conf_perm conv9_2_mbox_conf_flat
PriorBox         conv9_2_mbox_priorbox 2 1 conv9_2_h_conv9_2_relu_splitncnn_0 data_splitncnn_0 conv9_2_mbox_priorbox -23300=1,2.640000e+02 -23301=1,3.150000e+02 -23302=1,2.000000e+00 3=1.000000e-01 4=1.000000e-01 5=2.000000e-01 6=2.000000e-01 7=1 8=0 9=-233 10=-233 11=3.000000e+02 12=3.000000e+02 13=5.000000e-01
Concat           mbox_loc         6 1 conv4_3_norm_mbox_loc_flat fc7_mbox_loc_flat conv6_2_mbox_loc_flat conv7_2_mbox_loc_flat conv8_2_mbox_loc_flat conv9_2_mbox_loc_flat mbox_loc 0=0
Concat           mbox_conf        6 1 conv4_3_norm_mbox_conf_flat fc7_mbox_conf_flat conv6_2_mbox_conf_flat conv7_2_mbox_conf_flat conv8_2_mbox_conf_flat conv9_2_mbox_conf_flat mbox_conf 0=0
Concat           mbox_priorbox    6 1 conv4_3_norm_mbox_priorbox fc7_mbox_priorbox conv6_2_mbox_priorbox conv7_2_mbox_priorbox conv8_2_mbox_priorbox conv9_2_mbox_priorbox mbox_priorbox 0=1
Reshape          mbox_conf_reshape 1 1 mbox_conf mbox_conf_reshape 0=2 1=-1 2=-233 3=0
Softmax          mbox_conf_softmax 1 1 mbox_conf_reshape mbox_conf_softmax 0=1 1=1
Flatten          mbox_conf_flatten 1 1 mbox_conf_softmax mbox_conf_flatten
DetectionOutput  detection_out    3 1 mbox_loc mbox_conf_flatten mbox_priorbox detection_out 0=2 1=4.500000e-01 2=400 3=200 4=1.000000e-02
